In [2]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [3]:
df_demographics = pd.read_csv("London ward data demographics(1).csv", sep='\t')
display(df_demographics.loc[521]['Wardname'])

'Richmond upon Thames - Ham, Petersham & Richmond Riverside  19.1237762915576    16.7    15.9    30.5    7.6'

| Variable Name | Description |
|:-------------------------------:|:-----------:|
|       Wardname                 |  Wardname         |
| Children | |
| Greeaterthan65 | % All Older people aged 65+ - 2011 |
| nonwhite | % BAME - 2011 |
| NotBorninUK | % Not Born in UK - 2011 |
| NotEnglishspeaking | % English is First Language of no one in the household - 2011 |

In [4]:
df_demographics.loc[520:522]

,Wardname,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking
520,Islington - Saint Peter's,14.819827,9.8,25.6,32.0,9.5
521,"Richmond upon Thames - Ham, Petersham & Richmo...",NaN,NaN,NaN,NaN,NaN
522,Richmond upon Thames - Mortlake & Barnes Common,19.791190,12.0,11.7,25.6,5.2

In [5]:
added = ["Richmond upon Thames - Ham, Petersham & Richmond Riverside", 19.1237762915576, 16.7, 15.9, 30.5, 7.6]

In [6]:
df_demographics.loc[521] = added
df_demographics

,Wardname,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking
0,Hackney - Queensbridge,17.542063,8.2,44.7,38.3,11.8
1,Hammersmith & Fulham - S&s End,17.915361,8.4,30.6,39.0,11.8
2,Barking & Dagenham - River,26.851598,10.1,38.4,30.9,9.6
3,Tower Hamlets - Bethnal Green North,18.555872,7.0,49.4,38.7,15.0
4,Merton - Abbey,15.731861,8.5,26.6,38.3,12.5
...,...,...,...,...,...,...
618,Haringey - Harringay,14.767932,7.5,34.5,49.2,24.3
619,Lambeth - Coldharbour,21.562202,6.1,62.1,43.7,13.3
620,Newham - Plaistow North,23.600517,7.1,73.4,52.1,23.6
621,Greenwich - Abbey Wood,26.853031,9.6,46.3,32.0,7.6
622,Southwark - South Camberwell,19.684852,7.1,44.1,35.8,7.7

In [7]:
#df_demographics.drop(df_demographics.index[[521]], inplace=True)

In [8]:
df_demographics.loc[520:522]

,Wardname,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking
520,Islington - Saint Peter's,14.819827,9.8,25.6,32.0,9.5
521,"Richmond upon Thames - Ham, Petersham & Richmo...",19.123776,16.7,15.9,30.5,7.6
522,Richmond upon Thames - Mortlake & Barnes Common,19.791190,12.0,11.7,25.6,5.2

In [9]:
info=pd.DataFrame(df_demographics.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(df_demographics.isna().sum()).T.rename(index={0:'Null values count'}))
info=info.append(pd.DataFrame(df_demographics.isna().sum()/df_demographics.shape[0]*100).T.
                         rename(index={0:'Null values (%)'}))
info=info.append(pd.DataFrame(df_demographics.min()).T.rename(index={0:'Min values'}))
info=info.append(pd.DataFrame(df_demographics.max()).T.rename(index={0:'Max values'}))
info

,Wardname,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking
Data type,object,float64,float64,float64,float64,float64
Null values count,0,0,0,0,0,0
Null values (%),0.0,0.0,0.0,0.0,0.0,0.0
Min values,Barking & Dagenham - Abbey,7.133676,3.5,4.1,5.1,0.4
Max values,Westminster - Westbourne,33.187914,23.5,93.7,68.5,99.7

| Variable Name | Description |
|:-------------------------------:|:-----------:|
|       Crimerate                 | Crime rate - 2011/12         |
| Population2011Cencus | Population 2011 (Cencus) |
| Openspace | % area that is open space - 2012 |

In [10]:
df_health = pd.read_csv("london ward data health(1).csv")
df_health

,Unnamed: 0,Wardname,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy
0,0,Bromley - Darwin,5110.0,63.8,81.2,82.4
1,1,Kensington and Chelsea - Royal Hospital,7252.0,52.3,80.5,89.6
2,2,Hillingdon - Harefield,7399.0,55.8,78.3,82.3
3,3,Hammersmith and Fulham - Palace Riverside,7483.0,40.0,80.9,89.0
4,4,Kensington and Chelsea - Pembridge,7659.0,40.4,82.1,85.7
...,...,...,...,...,...,...
617,617,Greenwich - Woolwich Riverside,19120.0,84.4,73.8,80.2
618,618,Tower Hamlets - Blackwall and Cubitt Town,19461.0,75.1,77.4,83.4
619,619,Greenwich - Thamesmead Moorings,19730.0,122.5,74.3,77.5
620,620,Barnet - Childs Hill,20049.0,69.0,77.4,82.0
621,621,Tower Hamlets - Millwall,23084.0,58.1,83.6,95.0

| Variable Name | Description |
|:-------------------------------:|:-----------:|
| GeneralFertilityRate | General Fertility Rate - 2011 |
| Malelifeexpectancy | Male life expectancy - 2005-2009 |
| Femalelifeexpectancy | Female life expectancy - 2005-2009 |

In [11]:
df_health = df_health.drop('Unnamed: 0', axis=1)
df_health

,Wardname,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy
0,Bromley - Darwin,5110.0,63.8,81.2,82.4
1,Kensington and Chelsea - Royal Hospital,7252.0,52.3,80.5,89.6
2,Hillingdon - Harefield,7399.0,55.8,78.3,82.3
3,Hammersmith and Fulham - Palace Riverside,7483.0,40.0,80.9,89.0
4,Kensington and Chelsea - Pembridge,7659.0,40.4,82.1,85.7
...,...,...,...,...,...
617,Greenwich - Woolwich Riverside,19120.0,84.4,73.8,80.2
618,Tower Hamlets - Blackwall and Cubitt Town,19461.0,75.1,77.4,83.4
619,Greenwich - Thamesmead Moorings,19730.0,122.5,74.3,77.5
620,Barnet - Childs Hill,20049.0,69.0,77.4,82.0
621,Tower Hamlets - Millwall,23084.0,58.1,83.6,95.0

In [12]:
info=pd.DataFrame(df_health.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(df_health.isna().sum()).T.rename(index={0:'Null values count'}))
info=info.append(pd.DataFrame(df_health.isna().sum()/df_health.shape[0]*100).T.
                         rename(index={0:'Null values (%)'}))
info=info.append(pd.DataFrame(df_health.min()).T.rename(index={0:'Min values'}))
info=info.append(pd.DataFrame(df_health.max()).T.rename(index={0:'Max values'}))
info

,Wardname,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy
Data type,object,float64,float64,float64,float64
Null values count,0,0,0,0,0
Null values (%),0.0,0.0,0.0,0.0,0.0
Min values,Barking and Dagenham - Abbey,5110.0,22.1,71.2,75.9
Max values,Westminster - Westbourne,23084.0,130.2,178.0,99.6

In [13]:
#temp = df_health["Wardname"].str.split(" - ", n = 1, expand = True)
# 
#df_health["District"]= temp[0]
# 
# making separate last name column from new data frame
#df_health["Ward name"]= temp[1]
# 
# Dropping old Name columns
#df_health.drop(columns =["Wardname"], inplace = True)
 
#df_health

Population2011Census in df_health and df_environment doesn't have the same data type, so the one in df_health will be turnen into int.

In [14]:
df_health['Population2011Census'] = df_health['Population2011Census'].astype(int)
info=pd.DataFrame(df_health.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(df_health.isna().sum()).T.rename(index={0:'Null values count'}))
info=info.append(pd.DataFrame(df_health.isna().sum()/df_health.shape[0]*100).T.
                         rename(index={0:'Null values (%)'}))
info=info.append(pd.DataFrame(df_health.min()).T.rename(index={0:'Min values'}))
info=info.append(pd.DataFrame(df_health.max()).T.rename(index={0:'Max values'}))
info

,Wardname,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy
Data type,object,int32,float64,float64,float64
Null values count,0,0,0,0,0
Null values (%),0.0,0.0,0.0,0.0,0.0
Min values,Barking and Dagenham - Abbey,5110,22.1,71.2,75.9
Max values,Westminster - Westbourne,23084,130.2,178.0,99.6

There are 2 empty rows in the joined table, as shown above. \n
`00AYGN` = Lambeth - Stockwell
`00BCGL` = Redbridge - Loxford

Source: https://data.london.gov.uk/dataset/ward-profiles-and-atlas

In [15]:
df_demographics['Wardname'] = df_demographics['Wardname'].replace('&', 'and', regex=True)
df_health['Wardname'] = df_health['Wardname'].replace('&', 'and', regex=True)
df_demographics['Wardname'] = df_demographics['Wardname'].replace('St.', 'Saint', regex=True)
df_health['Wardname'] = df_health['Wardname'].replace('St.', 'Saint', regex=True)

In [16]:
#df_demographics[df_demographics['Wardname'].str.contains('Richmond upon Thames')]

In [17]:
#temp = df_demographics["Wardname"].str.split(" - ", n = 1, expand = True)
# 
#df_demographics["District"]= temp[0]
# 
# making separate last name column from new data frame
#df_demographics["Ward name"]= temp[1]
 
# Dropping old Name columns
#df_demographics.drop(columns =["Wardname"], inplace = True)
 
#df_demographics

In [18]:
health_demo=pd.merge(df_health,df_demographics,on='Wardname', how='left')
info=pd.DataFrame(health_demo.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(health_demo.isna().sum()).T.rename(index={0:'Null values count'}))
info

,Wardname,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking
Data type,object,int32,float64,float64,float64,float64,float64,float64,float64,float64
Null values count,0,0,0,0,0,1,1,1,1,1

In [19]:
health_demo[health_demo['Children'].isna()]

,Wardname,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking
67,Sutton - The Wrythe,10163,63.8,77.5,83.9,NaN,NaN,NaN,NaN,NaN

In [20]:
temp = health_demo["Wardname"].str.split(" - ", n = 1, expand = True)
 
health_demo["District"]= temp[0]
 
#making separate last name column from new data frame
health_demo["Ward name"]= temp[1]

#Dropping old Name columns
health_demo.drop(columns =["Wardname"], inplace = True)

health_demo

,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking,District,Ward name
0,5110,63.8,81.2,82.4,18.317025,21.9,4.8,6.1,0.4,Bromley,Darwin
1,7252,52.3,80.5,89.6,12.851627,20.1,15.4,44.8,16.7,Kensington and Chelsea,Royal Hospital
2,7399,55.8,78.3,82.3,19.245844,17.0,12.5,13.3,3.1,Hillingdon,Harefield
3,7483,40.0,80.9,89.0,18.334892,14.7,15.0,34.1,8.2,Hammersmith and Fulham,Palace Riverside
4,7659,40.4,82.1,85.7,13.317665,11.8,22.1,51.2,20.2,Kensington and Chelsea,Pembridge
...,...,...,...,...,...,...,...,...,...,...,...
617,19120,84.4,73.8,80.2,23.629707,6.2,49.0,39.4,13.3,Greenwich,Woolwich Riverside
618,19461,75.1,77.4,83.4,17.804840,4.7,50.4,48.6,21.9,Tower Hamlets,Blackwall and Cubitt Town
619,19730,122.5,74.3,77.5,28.646731,4.7,57.6,41.8,12.1,Greenwich,Thamesmead Moorings
620,20049,69.0,77.4,82.0,19.173026,12.4,38.9,51.2,23.0,Barnet,Childs Hill
621,23084,58.1,83.6,95.0,15.560561,3.5,47.6,52.1,23.4,Tower Hamlets,Millwall

In [21]:
df_environment = pd.read_csv("London ward data environment(1).csv")
info=pd.DataFrame(df_environment.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(df_environment.isna().sum()).T.rename(index={0:'Null values count'}))
info=info.append(pd.DataFrame(df_environment.isna().sum()/df_environment.shape[0]*100).T.
                         rename(index={0:'Null values (%)'}))
info=info.append(pd.DataFrame(df_environment.min()).T.rename(index={0:'Min values'}))
info=info.append(pd.DataFrame(df_environment.max()).T.rename(index={0:'Max values'}))
info=info.append(pd.DataFrame(df_environment.nunique()).T.rename(index={0:'Number of unique value'}))
info

                       Wardcode Population2011Census Crimerate Openspace
Data type                object                int64   float64   float64
Null values count             0                    0         0         0
Null values (%)             0.0                  0.0       0.0       0.0
Min values               00ABFX                 5110       0.9       0.0
Max values               00BKGW                23084    2100.2      99.9
Number of unique value      624                  601       490       378

In [22]:
#df_environment['Wardcode'][0][0:4]

In [23]:
df_socio = pd.read_csv("London ward data socioeconomic(1).csv")
df_socio = df_socio.drop('Unnamed: 0', axis=1)
df_socio

    Wardcode  hhSocialRented  JobSeekers  Noqual  Carsperhousehold
0     00ABFX            26.7         8.7    16.4               0.5
1     00ABFY            36.8        10.2    31.2               0.8
2     00ABFZ            29.4        10.2    28.0               0.9
3     00ABGB            20.0         8.8    29.9               1.1
4     00ABGC            37.4        10.2    28.9               0.8
..       ...             ...         ...     ...               ...
652      NaN             NaN         NaN     NaN               NaN
653      NaN             NaN         NaN     NaN               NaN
654      NaN             NaN         NaN     NaN               NaN
655      NaN             NaN         NaN     NaN               NaN
656      NaN             NaN         NaN     NaN               NaN

[657 rows x 5 columns]

In [24]:
info=pd.DataFrame(df_socio.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(df_socio.isna().sum()).T.rename(index={0:'Null values count'}))
info=info.append(pd.DataFrame(df_socio.isna().sum()/df_socio.shape[0]*100).T.
                         rename(index={0:'Null values (%)'}))
info=info.append(pd.DataFrame(df_socio.min()).T.rename(index={0:'Min values'}))
info=info.append(pd.DataFrame(df_socio.max()).T.rename(index={0:'Max values'}))
info=info.append(pd.DataFrame(df_socio.nunique()).T.rename(index={0:'Number of unique value'}))
info

,Wardcode,hhSocialRented,JobSeekers,Noqual,Carsperhousehold
Data type,object,float64,float64,float64,float64
Null values count,36,36,36,36,36
Null values (%),5.479452,5.479452,5.479452,5.479452,5.479452
Min values,NaN,1.1,0.4,3.8,0.2
Max values,NaN,68.4,31.6,35.8,7.2
Number of unique value,621,346,130,224,17

In [25]:
df_socio = df_socio.dropna()
df_socio

    Wardcode  hhSocialRented  JobSeekers  Noqual  Carsperhousehold
0     00ABFX            26.7         8.7    16.4               0.5
1     00ABFY            36.8        10.2    31.2               0.8
2     00ABFZ            29.4        10.2    28.0               0.9
3     00ABGB            20.0         8.8    29.9               1.1
4     00ABGC            37.4        10.2    28.9               0.8
..       ...             ...         ...     ...               ...
616   00BKGR            29.3         2.7    12.5               0.4
617   00BKGS            34.5         4.3    11.7               0.4
618   00BKGT            28.2         4.0     9.4               0.5
619   00BKGU            48.5        10.0    22.4               0.4
620   00BKGW            23.5         3.4     9.6               0.4

[621 rows x 5 columns]

In [26]:
df_environment[df_environment['Wardcode'].str.len() != 6]

     Wardcode  Population2011Census  Crimerate  Openspace
126  00BAGDag                  9816       61.0       12.3

In [27]:
#df_environment.loc[126]['Wardcode'] = df_environment.loc[126]['Wardcode'][0:6]
df_environment.loc[126,['Wardcode']] = df_environment.loc[126]['Wardcode'][0:6]

In [28]:
df_socio[df_socio['Wardcode'].str.len() != 6]

    Wardcode  hhSocialRented  JobSeekers  Noqual  Carsperhousehold
107  00AGGK#            45.9         6.3    17.8               0.5

In [29]:
df_socio.loc[107,['Wardcode']] = df_socio.loc[107]['Wardcode'][0:6]

In [30]:
envi_socio=pd.merge(df_environment,df_socio,on='Wardcode', how='left')
info=pd.DataFrame(envi_socio.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(envi_socio.isna().sum()).T.rename(index={0:'Null values count'}))
info

,Wardcode,Population2011Census,Crimerate,Openspace,hhSocialRented,JobSeekers,Noqual,Carsperhousehold
Data type,object,int64,float64,float64,float64,float64,float64,float64
Null values count,0,0,0,0,3,3,3,3

Now we got two joined table:
- Health and Demographic
- Socioenonomic and Environment

In [31]:
info=pd.DataFrame(health_demo.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(health_demo.isna().sum()).T.rename(index={0:'Null values count'}))
info=info.append(pd.DataFrame(health_demo.isna().sum()/health_demo.shape[0]*100).T.
                         rename(index={0:'Null values (%)'}))
info=info.append(pd.DataFrame(health_demo.min()).T.rename(index={0:'Min values'}))
info=info.append(pd.DataFrame(health_demo.max()).T.rename(index={0:'Max values'}))
info=info.append(pd.DataFrame(health_demo.nunique()).T.rename(index={0:'Number of unique value'}))
info

,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking,District,Ward name
Data type,int32,float64,float64,float64,float64,float64,float64,float64,float64,object,object
Null values count,0,0,0,0,1,1,1,1,1,0,0
Null values (%),0.0,0.0,0.0,0.0,0.160772,0.160772,0.160772,0.160772,0.160772,0.0,0.0
Min values,5110,22.1,71.2,75.9,7.133676,3.5,4.1,5.1,0.4,Barking and Dagenham,Abbey
Max values,23084,130.2,178.0,99.6,33.187914,23.5,93.7,68.5,99.7,Westminster,Yiewsley
Number of unique value,599,407,142,149,621,160,403,373,257,32,601

In [32]:
info=pd.DataFrame(envi_socio.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(envi_socio.isna().sum()).T.rename(index={0:'Null values count'}))
info=info.append(pd.DataFrame(envi_socio.isna().sum()/envi_socio.shape[0]*100).T.
                         rename(index={0:'Null values (%)'}))
info=info.append(pd.DataFrame(envi_socio.min()).T.rename(index={0:'Min values'}))
info=info.append(pd.DataFrame(envi_socio.max()).T.rename(index={0:'Max values'}))
info=info.append(pd.DataFrame(envi_socio.nunique()).T.rename(index={0:'Number of unique value'}))
info

,Wardcode,Population2011Census,Crimerate,Openspace,hhSocialRented,JobSeekers,Noqual,Carsperhousehold
Data type,object,int64,float64,float64,float64,float64,float64,float64
Null values count,0,0,0,0,3,3,3,3
Null values (%),0.0,0.0,0.0,0.0,0.480769,0.480769,0.480769,0.480769
Min values,00ABFX,5110,0.9,0.0,1.1,0.4,3.8,0.2
Max values,00BKGW,23084,2100.2,99.9,68.4,31.6,35.8,7.2
Number of unique value,624,601,490,378,346,130,224,17

Your task is to build a model which predicts life expectancy **at the ward level**. So we need some linkage between `envi_socio` and `health_demo`. Both joined table had `Population2011Census`, but the number of their unique values are not the same and their unique values < length of the table. So there might be some duplicate value. Thus, we need another attribute that can be used to link both table and `District` is chosen.
- We need `Districtcode` that was generated from `District` in `health_demo`
- We need `Districtcode` that was generated from the first 4 characters in `Wardcode`

In [33]:
district_code = []
for i in envi_socio.index:
    district_code.append(envi_socio['Wardcode'][i][0:4])
    #envi_socio['Districtcode'].iloc[i] = envi_socio['Wardcode'][i][0:4]
envi_socio['Districtcode'] = district_code
envi_socio

,Wardcode,Population2011Census,Crimerate,Openspace,hhSocialRented,JobSeekers,Noqual,Carsperhousehold,Districtcode
0,00ANGQ,11201,117.7,0.0,23.7,3.6,9.4,0.6,00AN
1,00ANGA,11518,114.0,0.3,24.9,4.5,9.3,0.5,00AN
2,00ADGN,10800,44.2,0.7,1.1,2.9,22.1,1.3,00AD
3,00BEGH,12321,65.3,0.7,20.3,4.6,12.3,0.7,00BE
4,00BCFZ,12609,64.3,1.3,4.7,4.2,17.2,1.2,00BC
...,...,...,...,...,...,...,...,...,...
619,00BDFZ,10317,65.8,81.9,18.5,3.1,14.1,1.0,00BD
620,00ARGW,12833,49.5,82.0,1.9,31.6,19.0,1.4,00AR
621,00ASGN,7399,67.4,85.5,24.0,3.2,23.8,1.4,00AS
622,00AFGQ,5110,58.6,88.8,5.5,1.6,21.9,1.7,00AF
623,00AZGW,16414,71.7,99.9,36.6,8.2,14.4,0.6,00AZ

In [34]:
df_districtcode = pd.read_csv("London District codes(1).csv")
df_districtcode.head()

               District Districtcode
0  Barking and Dagenham         00AB
1                Barnet         00AC
2                Bexley         00AD
3                 Brent         00AE
4               Bromley         00AF

In [35]:
key_list = list(health_demo['District'])
dict_lookup = dict(zip(df_districtcode['District'], df_districtcode['Districtcode']))

health_demo['Districtcode'] = [dict_lookup[item] for item in key_list]
for i in health_demo.index:
    health_demo['Districtcode'][i] = health_demo['Districtcode'][i][1:5]
health_demo

,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking,District,Ward name,Districtcode
0,5110,63.8,81.2,82.4,18.317025,21.9,4.8,6.1,0.4,Bromley,Darwin,00AF
1,7252,52.3,80.5,89.6,12.851627,20.1,15.4,44.8,16.7,Kensington and Chelsea,Royal Hospital,00AW
2,7399,55.8,78.3,82.3,19.245844,17.0,12.5,13.3,3.1,Hillingdon,Harefield,00AS
3,7483,40.0,80.9,89.0,18.334892,14.7,15.0,34.1,8.2,Hammersmith and Fulham,Palace Riverside,00AN
4,7659,40.4,82.1,85.7,13.317665,11.8,22.1,51.2,20.2,Kensington and Chelsea,Pembridge,00AW
...,...,...,...,...,...,...,...,...,...,...,...,...
617,19120,84.4,73.8,80.2,23.629707,6.2,49.0,39.4,13.3,Greenwich,Woolwich Riverside,00AL
618,19461,75.1,77.4,83.4,17.804840,4.7,50.4,48.6,21.9,Tower Hamlets,Blackwall and Cubitt Town,00BG
619,19730,122.5,74.3,77.5,28.646731,4.7,57.6,41.8,12.1,Greenwich,Thamesmead Moorings,00AL
620,20049,69.0,77.4,82.0,19.173026,12.4,38.9,51.2,23.0,Barnet,Childs Hill,00AC
621,23084,58.1,83.6,95.0,15.560561,3.5,47.6,52.1,23.4,Tower Hamlets,Millwall,00BG

In [46]:
df = pd.merge(envi_socio, health_demo, on=['Population2011Census', 'Districtcode'], how='left')
info=pd.DataFrame(df.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(df.isna().sum()).T.rename(index={0:'Null values count'}))
info

,Wardcode,Population2011Census,Crimerate,Openspace,hhSocialRented,JobSeekers,Noqual,Carsperhousehold,Districtcode,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking,District,Ward name
Data type,object,int64,float64,float64,float64,float64,float64,float64,object,float64,float64,float64,float64,float64,float64,float64,float64,object,object
Null values count,0,0,0,0,3,3,3,3,0,2,2,2,3,3,3,3,3,2,2

In [47]:
df['Adult'] = (100 - df['Children'] - df['Greaterthan65'])
col = df.loc[:, "Malelifeexpectancy":"Femalelifeexpectancy"]
df['LifeExpectancy'] = col.mean(axis=1)
df

,Wardcode,Population2011Census,Crimerate,Openspace,hhSocialRented,JobSeekers,Noqual,Carsperhousehold,Districtcode,GeneralFertilityRate,...,Femalelifeexpectancy,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking,District,Ward name,Adult,LifeExpectancy
0,00ANGQ,11201,117.7,0.0,23.7,3.6,9.4,0.6,00AN,47.3,...,81.1,16.650299,7.2,22.7,40.5,11.9,Hammersmith and Fulham,Town,76.149701,79.95
1,00ANGA,11518,114.0,0.3,24.9,4.5,9.3,0.5,00AN,49.4,...,88.6,14.559819,7.2,27.9,44.1,15.8,Hammersmith and Fulham,Addison,78.240181,83.70
2,00ADGN,10800,44.2,0.7,1.1,2.9,22.1,1.3,00AD,58.1,...,82.8,19.111111,15.7,15.4,12.4,2.6,Bexley,Falconwood and Welling,65.188889,80.50
3,00BEGH,12321,65.3,0.7,20.3,4.6,12.3,0.7,00BE,76.7,...,82.9,17.522928,8.7,28.2,25.9,5.6,Southwark,East Dulwich,73.777072,82.05
4,00BCFZ,12609,64.3,1.3,4.7,4.2,17.2,1.2,00BC,68.7,...,85.7,20.279166,14.8,64.2,40.5,12.8,Redbridge,Barkingside,64.920834,83.35
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
619,00BDFZ,10317,65.8,81.9,18.5,3.1,14.1,1.0,00BD,68.8,...,86.4,19.123776,16.7,15.9,30.5,7.6,Richmond upon Thames,"Ham, Petersham and Richmond Riverside",64.176224,82.35
620,00ARGW,12833,49.5,82.0,1.9,31.6,19.0,1.4,00AR,38.6,...,81.6,16.777059,22.5,4.8,6.1,0.9,Havering,Upminster,60.722941,80.85
621,00ASGN,7399,67.4,85.5,24.0,3.2,23.8,1.4,00AS,55.8,...,82.3,19.245844,17.0,12.5,13.3,3.1,Hillingdon,Harefield,63.754156,80.30
622,00AFGQ,5110,58.6,88.8,5.5,1.6,21.9,1.7,00AF,63.8,...,82.4,18.317025,21.9,4.8,6.1,0.4,Bromley,Darwin,59.782975,81.80
623,00AZGW,16414,71.7,99.9,36.6,8.2,14.4,0.6,00AZ,53.8,...,78.8,19.532107,7.0,49.4,36.9,10.9,Lewisham,Telegraph Hill,73.467893,77.60

In [38]:
df = df[['Population2011Census', 'Wardcode', 'Ward name', 'Districtcode', 'District', 'Crimerate', 'Openspace', 'hhSocialRented', 'JobSeekers', 'Noqual', 'Carsperhousehold', 'GeneralFertilityRate', 'Malelifeexpectancy', 'Femalelifeexpectancy', 'LifeExpectancy', 'Children', 'Adult', 'Greaterthan65', 'nonwhite', 'NotBorninUK', 'NotEnglishspeaking']]
df

,Population2011Census,Wardcode,Ward name,Districtcode,District,Crimerate,Openspace,hhSocialRented,JobSeekers,Noqual,...,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy,LifeExpectancy,Children,Adult,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking
0,11201,00ANGQ,Town,00AN,Hammersmith and Fulham,117.7,0.0,23.7,3.6,9.4,...,47.3,78.8,81.1,79.95,16.650299,76.149701,7.2,22.7,40.5,11.9
1,11518,00ANGA,Addison,00AN,Hammersmith and Fulham,114.0,0.3,24.9,4.5,9.3,...,49.4,78.8,88.6,83.70,14.559819,78.240181,7.2,27.9,44.1,15.8
2,10800,00ADGN,Falconwood and Welling,00AD,Bexley,44.2,0.7,1.1,2.9,22.1,...,58.1,78.2,82.8,80.50,19.111111,65.188889,15.7,15.4,12.4,2.6
3,12321,00BEGH,East Dulwich,00BE,Southwark,65.3,0.7,20.3,4.6,12.3,...,76.7,81.2,82.9,82.05,17.522928,73.777072,8.7,28.2,25.9,5.6
4,12609,00BCFZ,Barkingside,00BC,Redbridge,64.3,1.3,4.7,4.2,17.2,...,68.7,81.0,85.7,83.35,20.279166,64.920834,14.8,64.2,40.5,12.8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
619,10317,00BDFZ,"Ham, Petersham and Richmond Riverside",00BD,Richmond upon Thames,65.8,81.9,18.5,3.1,14.1,...,68.8,78.3,86.4,82.35,19.123776,64.176224,16.7,15.9,30.5,7.6
620,12833,00ARGW,Upminster,00AR,Havering,49.5,82.0,1.9,31.6,19.0,...,38.6,80.1,81.6,80.85,16.777059,60.722941,22.5,4.8,6.1,0.9
621,7399,00ASGN,Harefield,00AS,Hillingdon,67.4,85.5,24.0,3.2,23.8,...,55.8,78.3,82.3,80.30,19.245844,63.754156,17.0,12.5,13.3,3.1
622,5110,00AFGQ,Darwin,00AF,Bromley,58.6,88.8,5.5,1.6,21.9,...,63.8,81.2,82.4,81.80,18.317025,59.782975,21.9,4.8,6.1,0.4
623,16414,00AZGW,Telegraph Hill,00AZ,Lewisham,71.7,99.9,36.6,8.2,14.4,...,53.8,76.4,78.8,77.60,19.532107,73.467893,7.0,49.4,36.9,10.9

In [39]:
df.to_csv("dataset_ward_level.csv")

In [40]:
cols = [ val for val in df.columns if val != 'Population2011Census']
grouped_ = round(pd.concat([df.groupby(['Districtcode', 'District'])[cols].mean(), df.groupby(['Districtcode', 'District'])['Population2011Census'].sum()], axis=1).reset_index(),3)
grouped_.to_csv("dataset_district_level.csv")
grouped_

,Districtcode,District,Crimerate,Openspace,hhSocialRented,JobSeekers,Noqual,Carsperhousehold,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy,LifeExpectancy,Children,Adult,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking,Population2011Census
0,00AB,Barking and Dagenham,101.059,28.565,33.419,9.556,28.062,0.806,93.882,77.035,81.871,79.453,25.942,63.523,10.535,40.971,30.318,10.006,185911
1,00AC,Barnet,75.829,31.290,14.238,4.252,15.533,1.357,71.971,79.362,83.748,81.555,20.757,65.819,13.424,35.495,38.433,14.262,356386
2,00AD,Bexley,53.486,30.433,14.067,4.348,22.981,1.186,66.895,79.000,83.629,81.314,20.397,63.432,16.171,17.724,13.795,2.833,231997
3,00AE,Brent,106.410,20.743,22.452,7.848,19.243,0.843,81.067,79.505,85.995,82.750,20.047,69.315,10.638,63.795,55.162,22.776,311215
4,00AF,Bromley,67.214,42.345,13.473,3.886,18.109,1.218,61.586,79.491,83.782,81.636,19.523,63.477,17.000,15.232,14.123,2.873,309392
5,00AG,Camden,164.933,16.878,33.183,5.494,12.606,0.472,54.528,77.856,83.117,80.486,16.050,73.012,10.939,33.467,42.444,14.383,220338
6,00AH,Croydon,87.275,24.662,18.196,6.337,18.092,0.996,72.654,78.721,82.729,80.725,21.727,65.706,12.567,42.725,28.171,7.333,363378
7,00AJ,Ealing,96.048,28.574,18.000,6.196,16.530,0.922,78.035,78.965,84.983,81.974,20.296,68.960,10.743,50.961,48.091,21.448,338449
8,00AK,Enfield,74.119,35.571,17.105,7.867,22.876,1.005,74.800,78.524,82.938,80.731,22.096,65.219,12.686,37.914,34.452,13.895,312466
9,00AL,Greenwich,87.876,37.006,33.606,7.365,20.924,0.788,81.176,75.688,82.818,79.253,21.364,67.825,10.812,35.294,29.553,8.594,254557
10,00AM,Hackney,115.042,24.095,43.611,10.316,19.963,0.411,71.411,76.489,83.268,79.879,20.895,72.011,7.095,45.332,38.984,14.500,246270
11,00AN,Hammersmith and Fulham,121.831,14.294,31.125,4.994,12.788,0.556,49.306,78.181,84.694,81.438,16.264,74.592,9.144,31.356,42.500,14.288,182493
12,00AP,Haringey,105.100,25.768,26.437,9.389,17.479,0.616,64.211,76.158,83.684,79.921,20.217,70.919,8.863,38.289,43.616,18.237,254926
13,00AQ,Harrow,59.014,24.124,10.281,3.814,16.700,1.205,68.514,80.014,85.000,82.507,20.063,65.732,14.205,57.452,44.462,16.024,239056
14,00AR,Havering,71.211,44.533,13.828,6.428,26.539,1.228,58.678,78.178,82.711,80.444,18.651,63.388,17.961,12.206,10.128,2.239,237232
15,00AS,Hillingdon,93.491,39.400,16.564,4.005,19.100,1.232,70.927,77.918,83.509,80.714,20.564,66.163,13.273,37.682,28.964,9.618,273936
16,00AT,Hounslow,100.985,33.025,22.545,4.420,17.450,1.000,81.200,78.255,83.810,81.032,20.223,69.072,10.705,48.005,42.885,17.530,253958
17,00AU,Islington,127.131,13.512,41.994,6.481,16.969,0.413,47.738,75.262,81.819,78.541,15.918,75.251,8.831,31.488,35.206,12.081,206125
18,00AW,Kensington and Chelsea,123.778,17.983,25.111,4.267,10.189,0.567,54.017,84.311,87.739,86.025,15.288,72.529,12.183,29.033,51.394,20.533,158649
19,00AX,Kingston upon Thames,69.375,27.344,11.656,2.450,13.688,1.131,60.969,79.469,84.062,81.766,18.971,68.136,12.894,25.644,28.188,9.231,160060
20,00AY,Lambeth,125.275,20.035,34.074,7.711,13.911,0.526,56.180,76.115,81.580,78.848,17.963,74.297,7.740,42.495,38.440,11.810,288309
21,00AZ,Lewisham,97.911,25.411,30.861,7.872,17.961,0.667,69.167,75.867,80.928,78.397,20.779,69.655,9.567,46.244,33.489,9.056,275885
22,00BA,Merton,69.275,29.015,13.740,4.240,15.100,0.940,79.130,80.340,84.660,82.500,19.354,68.901,11.745,34.510,37.575,11.890,199693
23,00BB,Newham,103.500,20.715,28.780,9.570,20.690,0.610,82.475,76.255,80.880,78.568,22.727,70.613,6.660,70.830,53.615,24.725,307984
24,00BC,Redbridge,87.240,28.455,10.520,5.655,18.310,1.100,78.650,79.105,83.350,81.227,21.864,65.641,12.495,53.965,34.990,11.865,262426
25,00BD,Richmond upon Thames,61.772,46.900,12.661,2.094,10.722,1.061,70.933,80.572,85.539,83.056,19.746,66.688,13.567,14.072,24.161,5.961,186990
26,00BE,Southwark,114.233,17.810,43.581,7.881,16.400,0.529,63.405,77.490,83.457,80.474,18.610,73.590,7.800,45.443,39.171,10.867,288283
27,00BF,Sutton,60.711,26.122,14.244,3.844,18.556,1.178,65.733,84.350,83.067,83.708,19.910,65.602,14.488,21.582,20.094,10.759,190146
28,00BG,Tower Hamlets,117.000,21.829,40.294,10.788,20.125,0.412,65.641,77.000,83.876,80.438,19.712,74.047,6.241,54.812,42.694,19.253,254096
29,00BH,Waltham Forest,98.940,28.520,21.935,8.895,21.030,0.795,85.895,76.985,82.365,79.675,21.227,68.498,10.275,46.460,37.410,14.090,258249
30,00BJ,Wandsworth,77.315,25.005,20.195,3.940,11.560,0.690,59.005,77.135,82.045,79.590,16.578,74.667,8.755,28.335,35.180,9.800,306995
31,00BK,Westminster,307.430,18.405,26.495,5.120,12.880,0.475,52.085,82.790,87.360,85.075,14.649,74.066,11.285,37.450,52.910,21.895,219396